{
  "gigglebot": "Custom blocks",
  "gigglebot.distanceSensorReadRangeContinuous": "Get a reading of how far an obstacle is from the distanse sensor.",
  "gigglebot.distanceSensorReadRangeSingle": "Distance Sensor: takes a single reading.",
  "gigglebot.distanceSensorTestForObstacle": "Test for the presence of an obstacle.",
  "gigglebot.driveMillisec": "Will let gigglebot move forward or backward for a number of milliseconds.\nDistance covered during that time is related to the freshness of the batteries.",
  "gigglebot.driveStraight": "Will let gigglebot move forward or backward until told otherwise (either by a stop block or a turn block).",
  "gigglebot.gigglebotSpin": "Gigglebot will spin on itself until told otherwise, like a turn but staying in the same spot. Especially useful when drawing.",
  "gigglebot.gigglebotSpinMillisec": "Gigglebot will spin on itself for the provided number of milliseconds, like a turn but staying in the same spot. Especially useful when drawing",
  "gigglebot.lightFollow": "Will follow a spotlight shone on its eyes. If the spotlight disappears the gigglebot will stop.",
  "gigglebot.lightReadSensor": "Reads left or right light sensor. \nThe light sensors are placed in front of each eye neopixel, they're tiny! \nThe range is 0 through 1023, although in reality rarely above ~950.",
  "gigglebot.lineFollow": "A thin black line would fall between the two sensors. The gigglebot will stop when both sensors are reading black.\nA thick black line would have the two sensors on top of it at all times. The gigglebot will stop when both sensors are reading white.",
  "gigglebot.lineReadSensor": "Reads left or right line sensor",
  "gigglebot.lineSensorsRaw": "Reads the two line sensors",
  "gigglebot.lineTest": "Will return true if the whole line sensor is reading either black or white.",
  "gigglebot.onRemoteControl": "Use this block on the GiggleBot to control it with a second micro:bit",
  "gigglebot.onRemoteControl|param|radioBlock": "eg:1",
  "gigglebot.remoteControl": "Use this block to turn a second Micro:bit into a remote controller.\nEasiest approach is to put this block inside a \"Forever\" block.\nYou will need to use the \"remote receiver mode\" block on the GiggleBot itself.",
  "gigglebot.remoteControlAction": "@param",
  "gigglebot.remoteControl|param|radioBlock": "eg: 1",
  "gigglebot.setSpeed": "You can set the speed for each individual motor or both together. The higher the speed the less control the robot has.\nYou may need to correct the robot (see block in \"more...\" section).  A faster robot needs more correction than a slower one.\nIf you want to follow a line,  it will work best at a lower speed.\nActual speed is dependent on the freshness of the batteries.",
  "gigglebot.smile": "Lets you use the blocks in the neopixel category for better control over the smile/rainbow.",
  "gigglebot.smileCycleRainbow": "Displays the colors of the rainbow on the lights and cycles through them",
  "gigglebot.smileCycleRainbowTime": "Displays the colors of the rainbow on the lights and cycles through them based on times",
  "gigglebot.smileCycleRainbowTime|param|cycle_length": "how long (in ms) the cycling will last for: eg: 3000",
  "gigglebot.smileCycleRainbowTime|param|delay": "how long to wait(in ms) before cycling; eg: 100, 200",
  "gigglebot.smileCycleRainbow|param|nbcycles": "how many times the rainbow will do a full cycle; eg: 3, 5, 10",
  "gigglebot.smileRainbow": "Will display a rainbow of colors on the smile lights",
  "gigglebot.smileShowGraph": "Use the smile lights to display a line graph of a certain value on a graph of 0 to Max value",
  "gigglebot.steer": "Gigglebot will drive forward while steering to one side. \nUseful when it needs to go around an obstacle, or orbit around an object.\n0% means no steering, the same as the 'drive' block. 100% is the same as the 'turn' block.",
  "gigglebot.steerMillisec": "Gigglebot will drive forward while steering to one side for the provided number of milliseconds. \nUseful when it needs to go around an obstacle, or orbit around an object.\n0% means no steering, the same as the 'drive' block. 100% is the same as the 'turn' block.",
  "gigglebot.stop": "stops the robot.",
  "gigglebot.turn": "Will make gigglebot turn left or right until told otherwise (by a stop block or a drive block).",
  "gigglebot.turnMillisec": "Will make gigglebot turn left and right for a number of milliseconds. How far it turns depends on the freshness of the batteries.",
  "gigglebot.voltageShow": "Displays the current battery voltage. Anything lower than 3.4 is too low to run the motors",
  "gigglebot.whichEye": "Lets you use the blocks in the neopixel category for better control over the eyes.",
  "gigglebotWhichUniqueMotor": "Use this file to define custom functions and blocks.\nRead more at https://makecode.microbit.org/blocks/custom"
}